{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Acura",
    "1": "Alfa Romeo",
    "2": "Aston Martin",
    "3": "Audi",
    "4": "BMW",
    "5": "Bentley",
    "6": "Bugatti",
    "7": "Buick",
    "8": "Cadillac",
    "9": "Chevrolet",
    "10": "Chrysler",
    "11": "Citroen",
    "12": "Daewoo",
    "13": "Dodge",
    "14": "Ferrari",
    "15": "Fiat",
    "16": "Ford",
    "17": "GMC",
    "18": "Genesis",
    "19": "Honda",
    "20": "Hudson",
    "21": "Hyundai",
    "22": "Infiniti",
    "23": "Jaguar",
    "24": "Jeep",
    "25": "Kia",
    "26": "Lamborghini",
    "27": "Land Rover",
    "28": "Lexus",
    "29": "Lincoln",
    "30": "MG",
    "31": "Maserati",
    "32": "Mazda",
    "33": "McLaren",
    "34": "Mercedes-Benz",
    "35": "Mini",
    "36": "Mitsubishi",
    "37": "Nissan",
    "38": "Oldsmobile",
    "39": "Peugeot",
    "40": "Pontiac",
    "41": "Porsche",
    "42": "Ram",
    "43": "Ram Trucks",
    "44": "Renault",
    "45": "Rolls-Royce",
    "46": "Saab",
    "47": "Smart",
    "48": "Studebaker",
    "49": "Subaru",
    "50": "Suzuki",
    "51": "Tesla",
    "52": "Toyota",
    "53": "Volkswagen",
    "54": "Volvo"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acura": 0,
    "Alfa Romeo": 1,
    "Aston Martin": 2,
    "Audi": 3,
    "BMW": 4,
    "Bentley": 5,
    "Bugatti": 6,
    "Buick": 7,
    "Cadillac": 8,
    "Chevrolet": 9,
    "Chrysler": 10,
    "Citroen": 11,
    "Daewoo": 12,
    "Dodge": 13,
    "Ferrari": 14,
    "Fiat": 15,
    "Ford": 16,
    "GMC": 17,
    "Genesis": 18,
    "Honda": 19,
    "Hudson": 20,
    "Hyundai": 21,
    "Infiniti": 22,
    "Jaguar": 23,
    "Jeep": 24,
    "Kia": 25,
    "Lamborghini": 26,
    "Land Rover": 27,
    "Lexus": 28,
    "Lincoln": 29,
    "MG": 30,
    "Maserati": 31,
    "Mazda": 32,
    "McLaren": 33,
    "Mercedes-Benz": 34,
    "Mini": 35,
    "Mitsubishi": 36,
    "Nissan": 37,
    "Oldsmobile": 38,
    "Peugeot": 39,
    "Pontiac": 40,
    "Porsche": 41,
    "Ram": 42,
    "Ram Trucks": 43,
    "Renault": 44,
    "Rolls-Royce": 45,
    "Saab": 46,
    "Smart": 47,
    "Studebaker": 48,
    "Subaru": 49,
    "Suzuki": 50,
    "Tesla": 51,
    "Toyota": 52,
    "Volkswagen": 53,
    "Volvo": 54
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.2"
}
